interop-mock/src/main/resources/whitemesa/soap12/test-rpc/echoDate-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <ns1:echoDate soapenv:encodingStyle="http://www.w3.org/2003/05/soap-encoding" xmlns:ns1="http://example.org/ts-tests">
         <inputDate xsi:type="xsd:dateTime"><t:value expression="${inputDate}" type="dateTime" xmlns:t="http://axis.apache.org/mock/template"/></inputDate>
      </ns1:echoDate>
   </soapenv:Body>
</soapenv:Envelope>